ARM-software/CMSIS-FreeRTOS/Source/portable/ThirdParty/Community-Supported-Ports/GCC/RP2350_ARM_NTZ/non_secure/port.c
            /* Determine the maximum priority from which ISR safe FreeRTOS API
             * functions can be called. ISR safe functions are those that end in
             * "FromISR". FreeRTOS maintains separate thread and ISR API functions to
             * ensure interrupt entry is as fast and simple as possible.
             *
             * First, determine the number of priority bits available. Write to all
             * possible bits in the priority setting for SVCall. */
            portNVIC_SHPR2_REG = 0xFF000000;

            /* Read the value back to see how many bits stuck. */
            ucMaxPriorityValue = ( uint8_t ) ( ( portNVIC_SHPR2_REG & 0xFF000000 ) >> 24 );

            /* Use the same mask on the maximum system call priority. */
            ucMaxSysCallPriority = configMAX_SYSCALL_INTERRUPT_PRIORITY & ucMaxPriorityValue;

            /* Check that the maximum system call priority is nonzero after
             * accounting for the number of priority bits supported by the
             * hardware. A priority of 0 is invalid because setting the BASEPRI
             * register to 0 unmasks all interrupts, and interrupts with priority 0
             * cannot be masked using BASEPRI.
             * See https://www.FreeRTOS.org/RTOS-Cortex-M3-M4.html */
            configASSERT( ucMaxSysCallPriority );

            /* Check that the bits not implemented in hardware are zero in
             * configMAX_SYSCALL_INTERRUPT_PRIORITY. */
            configASSERT( ( configMAX_SYSCALL_INTERRUPT_PRIORITY & ( uint8_t ) ( ~( uint32_t ) ucMaxPriorityValue ) ) == 0U );

            /* Calculate the maximum acceptable priority group value for the number
             * of bits read back. */
            while( ( ucMaxPriorityValue & portTOP_BIT_OF_BYTE ) == portTOP_BIT_OF_BYTE )
            {
                ulImplementedPrioBits++;
                ucMaxPriorityValue <<= ( uint8_t ) 0x01;
            }

            if( ulImplementedPrioBits == 8 )
            {
                /* When the hardware implements 8 priority bits, there is no way for
                 * the software to configure PRIGROUP to not have sub-priorities. As
                 * a result, the least significant bit is always used for sub-priority
                 * and there are 128 preemption priorities and 2 sub-priorities.
                 *
                 * This may cause some confusion in some cases - for example, if
                 * configMAX_SYSCALL_INTERRUPT_PRIORITY is set to 5, both 5 and 4
                 * priority interrupts will be masked in Critical Sections as those
                 * are at the same preemption priority. This may appear confusing as
                 * 4 is higher (numerically lower) priority than
                 * configMAX_SYSCALL_INTERRUPT_PRIORITY and therefore, should not
                 * have been masked. Instead, if we set configMAX_SYSCALL_INTERRUPT_PRIORITY
                 * to 4, this confusion does not happen and the behaviour remains the same.
                 *
                 * The following assert ensures that the sub-priority bit in the
                 * configMAX_SYSCALL_INTERRUPT_PRIORITY is clear to avoid the above mentioned
                 * confusion. */
                configASSERT( ( configMAX_SYSCALL_INTERRUPT_PRIORITY & 0x1U ) == 0U );
                ulMaxPRIGROUPValue = 0;
            }
            else
            {
                ulMaxPRIGROUPValue = portMAX_PRIGROUP_BITS - ulImplementedPrioBits;
            }

            /* Shift the priority group value back to its position within the AIRCR
             * register. */
            ulMaxPRIGROUPValue <<= portPRIGROUP_SHIFT;
            ulMaxPRIGROUPValue &= portPRIORITY_GROUP_MASK;
        }
        #endif /* #if ( ( configASSERT_DEFINED == 1 ) && ( portHAS_ARMV8M_MAIN_EXTENSION == 1 ) ) */

        #if ( configENABLE_MPU == 1 )
        {
            /* Setup the Memory Protection Unit (MPU). */
            prvSetupMPU();
        }
        #endif /* configENABLE_MPU */

        if( ucPrimaryCoreNum == get_core_num() )
        {
            /* Start the timer that generates the tick ISR.  Interrupts are disabled
             * here already. */
            vPortSetupTimerInterrupt();

            /* Make PendSV and SysTick the lowest priority interrupts, and make SVCall
             * the highest priority. */
            portNVIC_SHPR3_REG |= portNVIC_SYSTICK_PRI;
            #if ( configUSE_DYNAMIC_EXCEPTION_HANDLERS == 1 )
                exception_set_exclusive_handler( SYSTICK_EXCEPTION, SysTick_Handler );
            #endif
        }
        /* Make PendSV and SysTick the lowest priority interrupts, and make SVCall
         * the highest priority. */
        portNVIC_SHPR3_REG |= portNVIC_PENDSV_PRI;
        portNVIC_SHPR2_REG = 0;

        #if ( configUSE_DYNAMIC_EXCEPTION_HANDLERS == 1 )
        exception_set_exclusive_handler( PENDSV_EXCEPTION, PendSV_Handler );
        exception_set_exclusive_handler( SVCALL_EXCEPTION, SVC_Handler );
        #endif

        /* Initialize the critical nesting count ready for the first task. */
        ulCriticalNestings[portGET_CORE_ID()] = 0;

        /* Install Doorbell handler to receive interrupt from other core */
        uint32_t irq_num = multicore_doorbell_irq_num(cDoorbellNum);
        irq_set_priority( irq_num, portMIN_INTERRUPT_PRIORITY );
        irq_set_exclusive_handler( irq_num, prvDoorbellInterruptHandler );
        irq_set_enabled( irq_num, 1 );

        #if ( ( configENABLE_MPU == 1 ) && ( configUSE_MPU_WRAPPERS_V1 == 0 ) )
        {
            xSchedulerRunning = pdTRUE;
        }
        #endif /* ( ( configENABLE_MPU == 1 ) && ( configUSE_MPU_WRAPPERS_V1 == 0 ) ) */

        /* Start the first task. */
        vStartFirstTask();

        /* Should never get here as the tasks will now be executing. Call the task
         * exit error function to prevent compiler warnings about a static function
         * not being called in the case that the application writer overrides this
         * functionality by defining configTASK_RETURN_ADDRESS. Call
         * vTaskSwitchContext() so link time optimization does not remove the
         * symbol. */
        vTaskSwitchContext( portGET_CORE_ID() );
        prvTaskExitError();

        /* Should not get here. */
        return 0;
    }

    static void prvDisableInterruptsAndPortStartSchedulerOnCore( void )
    {
        portDISABLE_INTERRUPTS();
        xPortStartSchedulerOnCore();
    }

    BaseType_t xPortStartScheduler( void )
    {
        configASSERT( ucPrimaryCoreNum == INVALID_PRIMARY_CORE_NUM );

        /* No one else should use these! */
        spin_lock_claim( configSMP_SPINLOCK_0 );
        spin_lock_claim( configSMP_SPINLOCK_1 );

        // claim same number of both cores for simplicity
        cDoorbellNum = (int8_t)multicore_doorbell_claim_unused(0b11, true);
        multicore_doorbell_clear_current_core(cDoorbellNum);
        multicore_doorbell_clear_other_core(cDoorbellNum);

        ucPrimaryCoreNum = configTICK_CORE;
        configASSERT( get_core_num() == 0 ); /* we must be started on core 0 */
        multicore_reset_core1();
        multicore_launch_core1( prvDisableInterruptsAndPortStartSchedulerOnCore );
        xPortStartSchedulerOnCore();

        /* Should not get here! */
        return 0;
    }

