ARM-software/CMSIS-FreeRTOS/Source/portable/ThirdParty/Community-Supported-Ports/GCC/RP2350_ARM_NTZ/non_secure/port.c
#else /* if ( configNUMBER_OF_CORES != 1 ) */
    BaseType_t xPortStartScheduler( void ) /* PRIVILEGED_FUNCTION */
    {
        /* An application can install FreeRTOS interrupt handlers in one of the
         * following ways:
         * 1. Direct Routing - Install the functions SVC_Handler and PendSV_Handler
         *    for SVCall and PendSV interrupts respectively.
         * 2. Indirect Routing - Install separate handlers for SVCall and PendSV
         *    interrupts and route program control from those handlers to
         *    SVC_Handler and PendSV_Handler functions.
         *
         * Applications that use Indirect Routing must set
         * configCHECK_HANDLER_INSTALLATION to 0 in their FreeRTOSConfig.h. Direct
         * routing, which is validated here when configCHECK_HANDLER_INSTALLATION
         * is 1, should be preferred when possible. */
        #if ( configCHECK_HANDLER_INSTALLATION == 1 && configUSE_DYNAMIC_EXCEPTION_HANDLERS == 0)
        {
            const portISR_t * const pxVectorTable = portSCB_VTOR_REG;

            /* Validate that the application has correctly installed the FreeRTOS
             * handlers for SVCall and PendSV interrupts. We do not check the
             * installation of the SysTick handler because the application may
             * choose to drive the RTOS tick using a timer other than the SysTick
             * timer by overriding the weak function vPortSetupTimerInterrupt().
             *
             * Assertion failures here indicate incorrect installation of the
             * FreeRTOS handlers. For help installing the FreeRTOS handlers, see
             * https://www.FreeRTOS.org/FAQHelp.html.
             *
             * Systems with a configurable address for the interrupt vector table
             * can also encounter assertion failures or even system faults here if
             * VTOR is not set correctly to point to the application's vector table. */
            configASSERT( pxVectorTable[ portVECTOR_INDEX_SVC ] == SVC_Handler );
            configASSERT( pxVectorTable[ portVECTOR_INDEX_PENDSV ] == PendSV_Handler );
        }
        #endif /* configCHECK_HANDLER_INSTALLATION */

        #if ( ( configASSERT_DEFINED == 1 ) && ( portHAS_ARMV8M_MAIN_EXTENSION == 1 ) )
        {
            volatile uint32_t ulImplementedPrioBits = 0;
            volatile uint8_t ucMaxPriorityValue;

            /* Determine the maximum priority from which ISR safe FreeRTOS API
             * functions can be called. ISR safe functions are those that end in
             * "FromISR". FreeRTOS maintains separate thread and ISR API functions to
             * ensure interrupt entry is as fast and simple as possible.
             *
             * First, determine the number of priority bits available. Write to all
             * possible bits in the priority setting for SVCall. */
            portNVIC_SHPR2_REG = 0xFF000000;

            /* Read the value back to see how many bits stuck. */
            ucMaxPriorityValue = ( uint8_t ) ( ( portNVIC_SHPR2_REG & 0xFF000000 ) >> 24 );

            /* Use the same mask on the maximum system call priority. */
            ucMaxSysCallPriority = configMAX_SYSCALL_INTERRUPT_PRIORITY & ucMaxPriorityValue;

            /* Check that the maximum system call priority is nonzero after
             * accounting for the number of priority bits supported by the
             * hardware. A priority of 0 is invalid because setting the BASEPRI
             * register to 0 unmasks all interrupts, and interrupts with priority 0
             * cannot be masked using BASEPRI.
             * See https://www.FreeRTOS.org/RTOS-Cortex-M3-M4.html */
            configASSERT( ucMaxSysCallPriority );

            /* Check that the bits not implemented in hardware are zero in
             * configMAX_SYSCALL_INTERRUPT_PRIORITY. */
            configASSERT( ( configMAX_SYSCALL_INTERRUPT_PRIORITY & ( uint8_t ) ( ~( uint32_t ) ucMaxPriorityValue ) ) == 0U );

            /* Calculate the maximum acceptable priority group value for the number
             * of bits read back. */
            while( ( ucMaxPriorityValue & portTOP_BIT_OF_BYTE ) == portTOP_BIT_OF_BYTE )
            {
                ulImplementedPrioBits++;
                ucMaxPriorityValue <<= ( uint8_t ) 0x01;
            }

            if( ulImplementedPrioBits == 8 )
            {
                /* When the hardware implements 8 priority bits, there is no way for
                 * the software to configure PRIGROUP to not have sub-priorities. As
                 * a result, the least significant bit is always used for sub-priority
                 * and there are 128 preemption priorities and 2 sub-priorities.
                 *
                 * This may cause some confusion in some cases - for example, if
                 * configMAX_SYSCALL_INTERRUPT_PRIORITY is set to 5, both 5 and 4
                 * priority interrupts will be masked in Critical Sections as those
                 * are at the same preemption priority. This may appear confusing as
                 * 4 is higher (numerically lower) priority than
                 * configMAX_SYSCALL_INTERRUPT_PRIORITY and therefore, should not
                 * have been masked. Instead, if we set configMAX_SYSCALL_INTERRUPT_PRIORITY
                 * to 4, this confusion does not happen and the behaviour remains the same.
                 *
                 * The following assert ensures that the sub-priority bit in the
                 * configMAX_SYSCALL_INTERRUPT_PRIORITY is clear to avoid the above mentioned
                 * confusion. */
                configASSERT( ( configMAX_SYSCALL_INTERRUPT_PRIORITY & 0x1U ) == 0U );
                ulMaxPRIGROUPValue = 0;
            }
            else
            {
                ulMaxPRIGROUPValue = portMAX_PRIGROUP_BITS - ulImplementedPrioBits;
            }

            /* Shift the priority group value back to its position within the AIRCR
             * register. */
            ulMaxPRIGROUPValue <<= portPRIGROUP_SHIFT;
            ulMaxPRIGROUPValue &= portPRIORITY_GROUP_MASK;
        }
        #endif /* #if ( ( configASSERT_DEFINED == 1 ) && ( portHAS_ARMV8M_MAIN_EXTENSION == 1 ) ) */

        /* Make PendSV and SysTick the lowest priority interrupts, and make SVCall
         * the highest priority. */
        portNVIC_SHPR3_REG |= portNVIC_PENDSV_PRI;
        portNVIC_SHPR3_REG |= portNVIC_SYSTICK_PRI;
        portNVIC_SHPR2_REG = 0;

